"""Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0 у дійсних числах.
Програма повинна видавати повідомлення про відсутність дійсних коренів,
якщо значення дискримінанта 𝐷 = 𝑏 2 −4𝑎𝑐 негативне, єдине рішення 𝑥 = − 𝑏 / 2𝑎 ,
якщо він дорівнює нулю, або два корені 𝑥1,2 = −b±D−−√/2a, якщо він позитивний."""

b = float(input("b: "))
c = float(input("c: "))
D = b**2 - 4 * a * c

if D < 0:
    print("Коренів нема!")
elif D == 0:
    x = (-b + D ** 1/2) / 2 * a
    print(x)
else:
    x1 = (-b + D ** 1/2) / 2 * a
    print(x1)
    x2 = (-b - D ** 1/2) / 2 * a
    print(x2)
