"""Написати програму визначення днів тижня. Дані про день тижня вводяться користувачем з клавіатури.
Якщо будній день - виводити на екран повідомлення "Сьогодні на роботу", у вихідні дні -
"Сьогодні вихідний", в інших випадках - "Такого дня не існує"."""

day = input("Введіть день тижня: ").lower()
match day:
    case"понеділок":
        print("Сьогодні на роботу")
    case"вівторок":
        print("Сьогодні на роботу")
    case"середа":
        print("Сьогодні на роботу")
    case"четверг":
        print("Сьогодні на роботу")
    case"п'ятниця":
        print("Сьогодні на роботу")
    case"субота":
        print("Сьогодні вихідний")
    case"неділя":
        print("Сьогодні вихідний")
    case _:
        print("Такого дня не існує")
